#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-toXHX27w5M5xkHN5

Waiting for the plan to start...

Terraform v1.0.10
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.quarkus_jjwt_jackson: Refreshing state... [id=quarkus-jjwt-jackson]
github_repository.quarkus_logging_sentry: Refreshing state... [id=quarkus-logging-sentry]
github_repository.quarkus_apicurio_registry_client: Refreshing state... [id=quarkus-apicurio-registry-client]
github_repository.quarkus_scala: Refreshing state... [id=quarkus-scala3]
github_repository.quarkus_microprofile: Refreshing state... [id=quarkus-microprofile]
github_repository.quarkus_hivemq_client: Refreshing state... [id=quarkus-hivemq-client]
github_repository.quarkus_lucene: Refreshing state... [id=quarkus-lucene]
github_repository.quarkus_mybatis: Refreshing state... [id=quarkus-mybatis]
github_repository.quarkus_logging_manager: Refreshing state... [id=quarkus-logging-manager]
github_repository.quarkus_unleash: Refreshing state... [id=quarkus-unleash]
github_repository.quarkus_elasticsearch_reactive: Refreshing state... [id=quarkus-elasticsearch-reactive]
github_repository.quarkus_cucumber: Refreshing state... [id=quarkus-cucumber]
github_repository.quarkus_kerberos: Refreshing state... [id=quarkus-kerberos]
github_repository.quarkus_datadog_opentracing: Refreshing state... [id=quarkus-datadog-opentracing]
github_repository.quarkus_freemarker: Refreshing state... [id=quarkus-freemarker]
github_repository.quarkus_config_extensions: Refreshing state... [id=quarkus-config-extensions]
github_repository.quarkus_jgrapht: Refreshing state... [id=quarkus-jgrapht]
github_repository.quarkus_rabbitmq_client: Refreshing state... [id=quarkus-rabbitmq-client]
github_repository.quarkus_jooq: Refreshing state... [id=quarkus-jooq]
github_repository.quarkus_jackson_jq: Refreshing state... [id=quarkus-jackson-jq]
github_repository.quarkus_logging_splunk: Refreshing state... [id=quarkus-logging-splunk]
github_repository.quarkus_shardingsphere_jdbc: Refreshing state... [id=quarkus-shardingsphere-jdbc]
github_repository.quarkus_univocity_parsers: Refreshing state... [id=quarkus-univocity-parsers]
github_repository.quarkus_logging_json: Refreshing state... [id=quarkus-logging-json]
github_repository.quarkus_logging_cloudwatch: Refreshing state... [id=quarkus-logging-cloudwatch]
github_repository.quarkus_operator_sdk: Refreshing state... [id=quarkus-operator-sdk]
github_repository.quarkus_logging_logback: Refreshing state... [id=quarkus-logging-logback]
github_repository.quarkus_cxf: Refreshing state... [id=quarkus-cxf]
github_repository.quarkus_morphia: Refreshing state... [id=quarkus-morphia]
github_repository.quarkus_prettytime: Refreshing state... [id=quarkus-prettytime]
github_repository.quarkus_jberet: Refreshing state... [id=quarkus-jberet]
github_repository.quarkus_rsocket: Refreshing state... [id=quarkus-rsocket]
github_repository.quarkus_hibernate_types: Refreshing state... [id=quarkus-hibernate-types]
github_repository.quarkus_tekton_client: Refreshing state... [id=quarkus-tekton-client]
github_repository.quarkus_doma: Refreshing state... [id=quarkus-doma]
github_repository.quarkus_maven_resolver: Refreshing state... [id=quarkus-maven-resolver]
github_repository.quarkus_tika: Refreshing state... [id=quarkus-tika]
github_repository.quarkus_zeebe: Refreshing state... [id=quarkus-zeebe]
github_repository.quarkus_github_app: Refreshing state... [id=quarkus-github-app]
github_repository.quarkus_qson: Refreshing state... [id=quarkus-qson]
github_repository.quarkus_minio: Refreshing state... [id=quarkus-minio]
github_repository.quarkus_github_api: Refreshing state... [id=quarkus-github-api]
github_repository.quarkus_xmlsec: Refreshing state... [id=quarkus-xmlsec]
github_repository.quarkus_google_cloud_services: Refreshing state... [id=quarkus-google-cloud-services]
github_repository.quarkus_jna: Refreshing state... [id=quarkus-jna]
github_repository.quarkus_mockk: Refreshing state... [id=quarkus-mockk]
github_repository.quarkus_opencv: Refreshing state... [id=quarkus-opencv]
github_repository.quarkus_reactive_messaging_http: Refreshing state... [id=quarkus-reactive-messaging-http]
github_repository.quarkus_micrometer_registry: Refreshing state... [id=quarkus-micrometer-registry]
github_branch.quarkus_apicurio_registry_client: Refreshing state... [id=quarkus-apicurio-registry-client:master]
github_team.quarkus_logging_sentry: Refreshing state... [id=5300000]
github_branch.quarkus_cucumber: Refreshing state... [id=quarkus-cucumber:main]
github_team.quarkus_logging_cloudwatch: Refreshing state... [id=4766806]
github_team.quarkus_hivemq_client: Refreshing state... [id=4651319]
github_team.quarkus_logging_json: Refreshing state... [id=4136031]
github_team.quarkus_cucumber: Refreshing state... [id=5020733]
github_team.quarkus_xmlsec: Refreshing state... [id=5249540]
github_team.quarkus_github_api: Refreshing state... [id=5327486]
github_team.quarkus_jooq: Refreshing state... [id=4499064]
github_team.quarkus_github_app: Refreshing state... [id=5327479]
github_team.quarkus_micrometer_registry: Refreshing state... [id=4331393]
github_team.quarkus_tika: Refreshing state... [id=5317008]
github_team.quarkus_logging_logback: Refreshing state... [id=4934360]
github_team.quarkus_shardingsphere_jdbc: Refreshing state... [id=5330628]
github_team.quarkus_jberet: Refreshing state... [id=4130738]
github_team.quarkus_zeebe: Refreshing state... [id=5333665]
github_team.quarkus_freemarker: Refreshing state... [id=4139356]
github_team.quarkus_logging_splunk: Refreshing state... [id=4611522]
github_team.quarkus_jgrapht: Refreshing state... [id=4691584]
github_team.quarkus_cxf: Refreshing state... [id=4221025]
github_team.quarkus_univocity_parsers: Refreshing state... [id=4707008]
github_team.quarkus_apicurio_registry_client: Refreshing state... [id=4359832]
github_team.quarkus_jjwt_jackson: Refreshing state... [id=4698127]
github_team.quarkus_kerberos: Refreshing state... [id=5330599]
github_team.quarkus_morphia: Refreshing state... [id=4994632]
github_team.quarkus_qson: Refreshing state... [id=5258394]
github_team.quarkus_unleash: Refreshing state... [id=4478763]
github_team.quarkus_logging_manager: Refreshing state... [id=4193789]
github_team.quarkus_rsocket: Refreshing state... [id=4628116]
github_team.quarkus_mybatis: Refreshing state... [id=4163389]
github_team.quarkus_minio: Refreshing state... [id=4257600]
github_team.quarkus_tekton_client: Refreshing state... [id=4429729]
github_team.quarkus_elasticsearch_reactive: Refreshing state... [id=4941463]
github_team.quarkus_lucene: Refreshing state... [id=4572442]
github_team.quarkus_maven_resolver: Refreshing state... [id=5330694]
github_team.quarkus_config_extensions: Refreshing state... [id=4679791]
github_team.quarkus_reactive_messaging_http: Refreshing state... [id=5290863]
github_team.quarkus_jackson_jq: Refreshing state... [id=5182252]
github_team.quarkus_opencv: Refreshing state... [id=5330519]
github_team.quarkus_jna: Refreshing state... [id=4257639]
github_team.quarkus_doma: Refreshing state... [id=4206574]
github_team.quarkus_hibernate_types: Refreshing state... [id=4427586]
github_team.quarkus_operator_sdk: Refreshing state... [id=4585468]
github_team.quarkus_microprofile: Refreshing state... [id=5018652]
github_team.quarkus_mockk: Refreshing state... [id=4479092]
github_team.quarkus_prettytime: Refreshing state... [id=4612233]
github_team.quarkus_datadog_opentracing: Refreshing state... [id=4759562]
github_branch.quarkus_elasticsearch_reactive: Refreshing state... [id=quarkus-elasticsearch-reactive:main]
github_team.quarkus_google_cloud_services: Refreshing state... [id=4133757]
github_team.quarkus_rabbitmq_client: Refreshing state... [id=4454281]
github_team.quarkus_scala: Refreshing state... [id=4973599]
github_branch.quarkus_config_extensions: Refreshing state... [id=quarkus-config-extensions:main]
github_app_installation_repository.quarkus_rabbitmq_client["20894091"]: Refreshing state... [id=20894091:quarkus-rabbitmq-client]
github_branch.quarkus_cxf: Refreshing state... [id=quarkus-cxf:master]
github_repository_collaborator.quarkus_jberet["aureamunoz"]: Refreshing state... [id=quarkus-jberet:aureamunoz]
github_repository_collaborator.quarkus_github_app["yrodiere"]: Refreshing state... [id=quarkus-github-app:yrodiere]
github_branch_default.quarkus_apicurio_registry_client: Refreshing state... [id=quarkus-apicurio-registry-client]
github_repository_collaborator.quarkus_google_cloud_services["dzou"]: Refreshing state... [id=quarkus-google-cloud-services:dzou]
github_team_repository.quarkus_logging_sentry: Refreshing state... [id=5300000:quarkus-logging-sentry]
github_team_membership.quarkus_logging_sentry["ia3andy"]: Refreshing state... [id=5300000:ia3andy]
github_branch_default.quarkus_cucumber: Refreshing state... [id=quarkus-cucumber]
github_team_membership.quarkus_logging_sentry["gsmet"]: Refreshing state... [id=5300000:gsmet]
github_team_repository.quarkus_logging_cloudwatch: Refreshing state... [id=4766806:quarkus-logging-cloudwatch]
github_team_membership.quarkus_logging_cloudwatch["bennetelli"]: Refreshing state... [id=4766806:bennetelli]
github_team_membership.quarkus_logging_cloudwatch["pilhuhn"]: Refreshing state... [id=4766806:pilhuhn]
github_team_repository.quarkus_hivemq_client: Refreshing state... [id=4651319:quarkus-hivemq-client]
github_team_membership.quarkus_hivemq_client["masini"]: Refreshing state... [id=4651319:masini]
github_team_membership.quarkus_logging_json["SlyngDK"]: Refreshing state... [id=4136031:SlyngDK]
github_team_repository.quarkus_logging_json: Refreshing state... [id=4136031:quarkus-logging-json]
github_team_repository.quarkus_cucumber: Refreshing state... [id=5020733:quarkus-cucumber]
github_team_membership.quarkus_cucumber["christophd"]: Refreshing state... [id=5020733:christophd]
github_team_membership.quarkus_cucumber["stuartwdouglas"]: Refreshing state... [id=5020733:stuartwdouglas]
github_team_repository.quarkus_xmlsec: Refreshing state... [id=5249540:quarkus-xmlsec]
github_team_membership.quarkus_github_api["quarkiversebot"]: Refreshing state... [id=5327486:quarkiversebot]
github_team_repository.quarkus_github_api: Refreshing state... [id=5327486:quarkus-github-api]
github_team_membership.quarkus_github_api["gsmet"]: Refreshing state... [id=5327486:gsmet]
github_team_repository.quarkus_jooq: Refreshing state... [id=4499064:quarkus-jooq]
github_team_membership.quarkus_jooq["angrymango"]: Refreshing state... [id=4499064:angrymango]
github_team_repository.quarkus_github_app: Refreshing state... [id=5327479:quarkus-github-app]
github_team_membership.quarkus_micrometer_registry["jonatan-ivanov"]: Refreshing state... [id=4331393:jonatan-ivanov]
github_team_membership.quarkus_github_app["gsmet"]: Refreshing state... [id=5327479:gsmet]
github_team_membership.quarkus_github_app["quarkiversebot"]: Refreshing state... [id=5327479:quarkiversebot]
github_team_repository.quarkus_micrometer_registry: Refreshing state... [id=4331393:quarkus-micrometer-registry]
github_team_membership.quarkus_micrometer_registry["kenfinnigan"]: Refreshing state... [id=4331393:kenfinnigan]
github_team_membership.quarkus_micrometer_registry["ebullient"]: Refreshing state... [id=4331393:ebullient]
github_team_repository.quarkus_tika: Refreshing state... [id=5317008:quarkus-tika]
github_team_membership.quarkus_tika["sberyozkin"]: Refreshing state... [id=5317008:sberyozkin]
github_team_membership.quarkus_logging_logback["stuartwdouglas"]: Refreshing state... [id=4934360:stuartwdouglas]
github_team_repository.quarkus_logging_logback: Refreshing state... [id=4934360:quarkus-logging-logback]
github_team_repository.quarkus_shardingsphere_jdbc: Refreshing state... [id=5330628:quarkus-shardingsphere-jdbc]
github_team_membership.quarkus_shardingsphere_jdbc["zhfeng"]: Refreshing state... [id=5330628:zhfeng]
github_team_membership.quarkus_jberet["radcortez"]: Refreshing state... [id=4130738:radcortez]
github_team_repository.quarkus_jberet: Refreshing state... [id=4130738:quarkus-jberet]
github_team_repository.quarkus_zeebe: Refreshing state... [id=5333665:quarkus-zeebe]
github_team_membership.quarkus_zeebe["andrejpetras"]: Refreshing state... [id=5333665:andrejpetras]
github_team_membership.quarkus_freemarker["vsevel"]: Refreshing state... [id=4139356:vsevel]
github_team_membership.quarkus_xmlsec["martinffx"]: Refreshing state... [id=5249540:martinffx]
github_team_repository.quarkus_freemarker: Refreshing state... [id=4139356:quarkus-freemarker]
github_team_membership.quarkus_xmlsec["gastaldi"]: Refreshing state... [id=5249540:gastaldi]
github_team_repository.quarkus_logging_splunk: Refreshing state... [id=4611522:quarkus-logging-splunk]
github_team_repository.quarkus_jgrapht: Refreshing state... [id=4691584:quarkus-jgrapht]
github_team_membership.quarkus_logging_splunk["vietk"]: Refreshing state... [id=4611522:vietk]
github_team_membership.quarkus_logging_splunk["rquinio1A"]: Refreshing state... [id=4611522:rquinio1A]
github_team_membership.quarkus_jgrapht["rsvoboda"]: Refreshing state... [id=4691584:rsvoboda]
github_team_repository.quarkus_cxf: Refreshing state... [id=4221025:quarkus-cxf]
github_team_membership.quarkus_cxf["shumonsharif"]: Refreshing state... [id=4221025:shumonsharif]
github_team_membership.quarkus_cxf["Dufgui"]: Refreshing state... [id=4221025:Dufgui]
github_team_membership.quarkus_cxf["dufoli"]: Refreshing state... [id=4221025:dufoli]
github_team_membership.quarkus_univocity_parsers["aruffie"]: Refreshing state... [id=4707008:aruffie]
github_team_repository.quarkus_univocity_parsers: Refreshing state... [id=4707008:quarkus-univocity-parsers]
github_team_membership.quarkus_apicurio_registry_client["famartinrh"]: Refreshing state... [id=4359832:famartinrh]
github_team_repository.quarkus_apicurio_registry_client: Refreshing state... [id=4359832:quarkus-apicurio-registry-client]
github_team_membership.quarkus_jjwt_jackson["gsmet"]: Refreshing state... [id=4698127:gsmet]
github_team_repository.quarkus_jjwt_jackson: Refreshing state... [id=4698127:quarkus-jjwt-jackson]
github_team_repository.quarkus_kerberos: Refreshing state... [id=5330599:quarkus-kerberos]
github_team_membership.quarkus_morphia["evanchooly"]: Refreshing state... [id=4994632:evanchooly]
github_team_membership.quarkus_kerberos["cescoffier"]: Refreshing state... [id=5330599:cescoffier]
github_team_membership.quarkus_kerberos["sberyozkin"]: Refreshing state... [id=5330599:sberyozkin]
github_team_membership.quarkus_kerberos["stuartwdouglas"]: Refreshing state... [id=5330599:stuartwdouglas]
github_team_repository.quarkus_morphia: Refreshing state... [id=4994632:quarkus-morphia]
github_team_repository.quarkus_qson: Refreshing state... [id=5258394:quarkus-qson]
github_team_membership.quarkus_qson["patriot1burke"]: Refreshing state... [id=5258394:patriot1burke]
github_team_repository.quarkus_unleash: Refreshing state... [id=4478763:quarkus-unleash]
github_team_membership.quarkus_unleash["andrejpetras"]: Refreshing state... [id=4478763:andrejpetras]
github_team_repository.quarkus_logging_manager: Refreshing state... [id=4193789:quarkus-logging-manager]
github_team_membership.quarkus_rsocket["dufoli"]: Refreshing state... [id=4628116:dufoli]
github_team_membership.quarkus_logging_manager["oscarfh"]: Refreshing state... [id=4193789:oscarfh]
github_team_membership.quarkus_logging_manager["phillip-kruger"]: Refreshing state... [id=4193789:phillip-kruger]
github_team_repository.quarkus_rsocket: Refreshing state... [id=4628116:quarkus-rsocket]
github_team_membership.quarkus_mybatis["zohar-soul"]: Refreshing state... [id=4163389:zohar-soul]
github_team_membership.quarkus_mybatis["zhfeng"]: Refreshing state... [id=4163389:zhfeng]
github_team_repository.quarkus_mybatis: Refreshing state... [id=4163389:quarkus-mybatis]
github_team_membership.quarkus_minio["jtama"]: Refreshing state... [id=4257600:jtama]
github_team_repository.quarkus_minio: Refreshing state... [id=4257600:quarkus-minio]
github_team_repository.quarkus_tekton_client: Refreshing state... [id=4429729:quarkus-tekton-client]
github_team_membership.quarkus_tekton_client["goldmann"]: Refreshing state... [id=4429729:goldmann]
github_team_repository.quarkus_elasticsearch_reactive: Refreshing state... [id=4941463:quarkus-elasticsearch-reactive]
github_team_membership.quarkus_elasticsearch_reactive["loicmathieu"]: Refreshing state... [id=4941463:loicmathieu]
github_team_membership.quarkus_lucene["gustavonalle"]: Refreshing state... [id=4572442:gustavonalle]
github_team_repository.quarkus_lucene: Refreshing state... [id=4572442:quarkus-lucene]
github_team_membership.quarkus_maven_resolver["aloubyansky"]: Refreshing state... [id=5330694:aloubyansky]
github_team_membership.quarkus_maven_resolver["gastaldi"]: Refreshing state... [id=5330694:gastaldi]
github_team_repository.quarkus_maven_resolver: Refreshing state... [id=5330694:quarkus-maven-resolver]
github_team_repository.quarkus_config_extensions: Refreshing state... [id=4679791:quarkus-config-extensions]
github_team_membership.quarkus_config_extensions["radcortez"]: Refreshing state... [id=4679791:radcortez]
github_team_repository.quarkus_reactive_messaging_http: Refreshing state... [id=5290863:quarkus-reactive-messaging-http]
github_team_membership.quarkus_reactive_messaging_http["michalszynkiewicz"]: Refreshing state... [id=5290863:michalszynkiewicz]
github_team_membership.quarkus_jackson_jq["aloubyansky"]: Refreshing state... [id=5182252:aloubyansky]
github_team_membership.quarkus_jackson_jq["ricardozanini"]: Refreshing state... [id=5182252:ricardozanini]
github_team_repository.quarkus_jackson_jq: Refreshing state... [id=5182252:quarkus-jackson-jq]
github_team_repository.quarkus_opencv: Refreshing state... [id=5330519:quarkus-opencv]
github_team_membership.quarkus_opencv["gsmet"]: Refreshing state... [id=5330519:gsmet]
github_team_membership.quarkus_jna["dufoli"]: Refreshing state... [id=4257639:dufoli]
github_team_repository.quarkus_jna: Refreshing state... [id=4257639:quarkus-jna]
github_team_repository.quarkus_doma: Refreshing state... [id=4206574:quarkus-doma]
github_team_repository.quarkus_hibernate_types: Refreshing state... [id=4427586:quarkus-hibernate-types]
github_team_membership.quarkus_doma["nakamura-to"]: Refreshing state... [id=4206574:nakamura-to]
github_team_membership.quarkus_hibernate_types["andrejpetras"]: Refreshing state... [id=4427586:andrejpetras]
github_team_repository.quarkus_operator_sdk: Refreshing state... [id=4585468:quarkus-operator-sdk]
github_team_repository.quarkus_microprofile: Refreshing state... [id=5018652:quarkus-microprofile]
github_team_membership.quarkus_microprofile["radcortez"]: Refreshing state... [id=5018652:radcortez]
github_team_membership.quarkus_operator_sdk["metacosm"]: Refreshing state... [id=4585468:metacosm]
github_team_membership.quarkus_mockk["glefloch"]: Refreshing state... [id=4479092:glefloch]
github_team_repository.quarkus_mockk: Refreshing state... [id=4479092:quarkus-mockk]
github_team_membership.quarkus_prettytime["gastaldi"]: Refreshing state... [id=4612233:gastaldi]
github_team_repository.quarkus_prettytime: Refreshing state... [id=4612233:quarkus-prettytime]
github_team_membership.quarkus_datadog_opentracing["nicolas-vivot"]: Refreshing state... [id=4759562:nicolas-vivot]
github_team_repository.quarkus_datadog_opentracing: Refreshing state... [id=4759562:quarkus-datadog-opentracing]
github_branch_default.quarkus_elasticsearch_reactive: Refreshing state... [id=quarkus-elasticsearch-reactive]
github_team_repository.quarkus_rabbitmq_client: Refreshing state... [id=4454281:quarkus-rabbitmq-client]
github_team_membership.quarkus_rabbitmq_client["bpasson"]: Refreshing state... [id=4454281:bpasson]
github_team_membership.quarkus_google_cloud_services["loicmathieu"]: Refreshing state... [id=4133757:loicmathieu]
github_team_repository.quarkus_scala: Refreshing state... [id=4973599:quarkus-scala3]
github_branch_default.quarkus_config_extensions: Refreshing state... [id=quarkus-config-extensions]
github_branch_default.quarkus_cxf: Refreshing state... [id=quarkus-cxf]
github_team_membership.quarkus_scala["GavinRay97"]: Refreshing state... [id=4973599:GavinRay97]
github_team_repository.quarkus_google_cloud_services: Refreshing state... [id=4133757:quarkus-google-cloud-services]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_team_repository.quarkus_elasticsearch_reactive has been changed
  ~ resource "github_team_repository" "quarkus_elasticsearch_reactive" {
      ~ etag       = "W/\"1c598f3755cc8f3e6cd411b7d5b397a765d943fa608c2287555501374e13b301\"" -> "W/\"eba3451922ea3fee6e76f83175234fcbb8e986194e739dfdfb23c342b2491015\""
        id         = "4941463:quarkus-elasticsearch-reactive"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_hibernate_types has been changed
  ~ resource "github_repository" "quarkus_hibernate_types" {
      ~ etag                   = "W/\"8bba77a1e9ff5244e29b108dd3302d62bd6c43387e1392cfcb13833150602e4a\"" -> "W/\"0d525e32c2f2fa28f80511d1fee1a793d4c51e62c3780c97425979530ccede75\""
        id                     = "quarkus-hibernate-types"
        name                   = "quarkus-hibernate-types"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_repository.quarkus_prettytime has been changed
  ~ resource "github_repository" "quarkus_prettytime" {
      ~ etag                   = "W/\"46243cb930d0dade4476f835a9ab50225cb89b6aaf55d9702a9d377fcbd98425\"" -> "W/\"9277f05a424961c03294e7456c3196af7f6140e700022524789eeca29671da1f\""
        id                     = "quarkus-prettytime"
        name                   = "quarkus-prettytime"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.quarkus_qson has been changed
  ~ resource "github_team_repository" "quarkus_qson" {
      ~ etag       = "W/\"7ef7e6a7fa00b2c1472909038bddc50a6fac98e4f0955f43ed6211d19b6300c8\"" -> "W/\"c8306b58dc20dd17ef58bb2f1035bf19af9300249568ba6f92b084e2f1204095\""
        id         = "5258394:quarkus-qson"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_jgrapht has been changed
  ~ resource "github_team_repository" "quarkus_jgrapht" {
      ~ etag       = "W/\"1f519f3c034e8de95507da7f2b6ac7c49c96c91484c58e4ef24f35966a85b1d4\"" -> "W/\"0a00492d8cbbd9c5ba40227dfcd37660c4dbf0112373c03d63135834a5b49baf\""
        id         = "4691584:quarkus-jgrapht"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_apicurio_registry_client has been changed
  ~ resource "github_team_repository" "quarkus_apicurio_registry_client" {
      ~ etag       = "W/\"5c181952466d75bdd883026dc8f0f11f1fb4c5d2a18646009c63d3aab1a4f6c5\"" -> "W/\"6892f072b3cfd1e08b069bfacc9450ffe9f9177228168a0821c1d98ae70bbd37\""
        id         = "4359832:quarkus-apicurio-registry-client"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_logging_splunk has been changed
  ~ resource "github_repository" "quarkus_logging_splunk" {
      ~ etag                   = "W/\"0efe6cb77ee0d032ef29603b11e362ce92d6df8fcde793210c9df26bf755b010\"" -> "W/\"033013fc48798f1e113e2374634c44be477f46e604b0037f079dac35630903e8\""
        id                     = "quarkus-logging-splunk"
        name                   = "quarkus-logging-splunk"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.quarkus_mybatis has been changed
  ~ resource "github_team_repository" "quarkus_mybatis" {
      ~ etag       = "W/\"07e5d6d3653daded17ddfddfc9182d7e957c3870a9c2dcb6de4c77947ae2dd4d\"" -> "W/\"f8cb7f6d5dc6cddc065e0ed367fe4820968f5973948d47dc2cdf0c17a974d69f\""
        id         = "4163389:quarkus-mybatis"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_reactive_messaging_http has been changed
  ~ resource "github_team_repository" "quarkus_reactive_messaging_http" {
      ~ etag       = "W/\"8db36ef3d243b12e6fbed23d29412da95b13e70659ee33f2b2ab316e0c38487b\"" -> "W/\"a53fb9f35d33c8b50370ef9338de911975826e1a4fda767704ac559fbf3c4336\""
        id         = "5290863:quarkus-reactive-messaging-http"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_github_api has been changed
  ~ resource "github_team_repository" "quarkus_github_api" {
      ~ etag       = "W/\"d129ba1352f8fa5457599eb33386e266df4afb4818a75126171f1ac3d8ddb5e7\"" -> "W/\"9f1cb02eb26afb14148212a893cf39264f56cad7c7a3e6db071115a0eda9f82a\""
        id         = "5327486:quarkus-github-api"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_github_app has been changed
  ~ resource "github_repository" "quarkus_github_app" {
      ~ etag                   = "W/\"6a28e36d0d4dfacf76c646e9bb729afe155fa3fe3a90fac90d8d8e4c71b6ff94\"" -> "W/\"d998c6df268f5f18457a90c3911ececcfa4eec643309b763f923a8e096a5511b\""
        id                     = "quarkus-github-app"
        name                   = "quarkus-github-app"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_micrometer_registry has been changed
  ~ resource "github_team_repository" "quarkus_micrometer_registry" {
      ~ etag       = "W/\"80f5eee5622da5046149802accd324a0cbaf9301fbe21591e6d0eb78d2d95df0\"" -> "W/\"da074b146f300298cc2d3a57e2c63baf42c79416fc73c804ecbf2ff7e8b7fbca\""
        id         = "4331393:quarkus-micrometer-registry"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_rabbitmq_client has been changed
  ~ resource "github_team_repository" "quarkus_rabbitmq_client" {
      ~ etag       = "W/\"698faa80749c75d800b1b3bc71d345c1dc7314a586f64e789c4b362fb477d9bb\"" -> "W/\"10c9a8007a8d8c794fe0f6f625124d3b94025509e4dc1d17194e28eb565886ce\""
        id         = "4454281:quarkus-rabbitmq-client"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_opencv has been changed
  ~ resource "github_team_repository" "quarkus_opencv" {
      ~ etag       = "W/\"8e8a7b991d8eb8d20243187b5ab71fa848f281d1232a08acbae30b05511117c0\"" -> "W/\"c667fcf624d98cd4a2d34fd546baf7ff52f41b4e692f47eeb4c4b67381061937\""
        id         = "5330519:quarkus-opencv"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_morphia has been changed
  ~ resource "github_team_repository" "quarkus_morphia" {
      ~ etag       = "W/\"6768c5eeccdfca9f3f98c660372b1a17a1085feaf770a5770317b6620f24fcb4\"" -> "W/\"9f79ed310041d827deb128826b384b1bf7b45c82766d19d8081f55f6f40e34f4\""
        id         = "4994632:quarkus-morphia"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_jgrapht has been changed
  ~ resource "github_repository" "quarkus_jgrapht" {
      ~ etag                   = "W/\"7d053452dfa6f0bcab2d5ae3d36cb57878b45b758a6d3545ee2d3301bf3a485f\"" -> "W/\"854173a5ee81c1d87a80b34f122d576fe8eaefd8bea488ee7945156f56c67557\""
        id                     = "quarkus-jgrapht"
        name                   = "quarkus-jgrapht"
        # (25 unchanged attributes hidden)
    }
  # github_repository.quarkus_datadog_opentracing has been changed
  ~ resource "github_repository" "quarkus_datadog_opentracing" {
      ~ etag                   = "W/\"dce991654cbad9adc545c8cd92cf1af531c92e60333a172231ab0dafbc193ffd\"" -> "W/\"0e559999e6512dc62f1e20310e5077e5a46fc1123b45f4afe5db702e717222ab\""
        id                     = "quarkus-datadog-opentracing"
        name                   = "quarkus-datadog-opentracing"
        # (25 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_tika has been changed
  ~ resource "github_team_repository" "quarkus_tika" {
      ~ etag       = "W/\"0f10abff9ad4d029f9766ff15d37a5f04f21ad5f039cdc20fc928e2b22573f0b\"" -> "W/\"849d82110e8ec79b6ecfba06b0b5b9e6378b4ac761b47fd6137f228fa1f42e5d\""
        id         = "5317008:quarkus-tika"
        # (3 unchanged attributes hidden)
    }
  # github_team_membership.quarkus_xmlsec["martinffx"] has been deleted
  - resource "github_team_membership" "quarkus_xmlsec" {
      - etag     = "W/\"985805ecff0118199d87f2432c7e1c76d238611acdf2a3369c4ac3d747b32538\"" -> null
      - id       = "5249540:martinffx" -> null
      - role     = "maintainer" -> null
      - team_id  = "5249540" -> null
      - username = "martinffx" -> null
    }
  # github_team_repository.quarkus_github_app has been changed
  ~ resource "github_team_repository" "quarkus_github_app" {
      ~ etag       = "W/\"10334fd6e80f6fba70dd8c14a2546b8432791dbdd990cf3c9fe75ea89b08fd06\"" -> "W/\"1eac4a5ad8e5298d4c995ccbbd5977bab9baa52b9727520e42adce910bba005c\""
        id         = "5327479:quarkus-github-app"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_cxf has been changed
  ~ resource "github_repository" "quarkus_cxf" {
      ~ etag                   = "W/\"6de0f9cba4dc46b5477438aa273b54c6902679a13aa61ce82dc32b74ac9aea88\"" -> "W/\"4a642ef4a9741a587f387b62bcecd31995f3a2bb849a555c5d8ab0862709cadf\""
        id                     = "quarkus-cxf"
        name                   = "quarkus-cxf"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_repository.quarkus_rabbitmq_client has been changed
  ~ resource "github_repository" "quarkus_rabbitmq_client" {
      ~ etag                   = "W/\"a545f958e238e7f1f4d37cecba0a7c3d3fbd16494bd3df71d87cb645ed0d9d65\"" -> "W/\"db14baa3c8a97841c9134cc2140366e2499cdd28fcf79c053d53b9f07c69ac64\""
        id                     = "quarkus-rabbitmq-client"
        name                   = "quarkus-rabbitmq-client"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.quarkus_jjwt_jackson has been changed
  ~ resource "github_team_repository" "quarkus_jjwt_jackson" {
      ~ etag       = "W/\"1536604055ef8b666c95cbcb2412bf582fd463a2ca82b278b2d3caacfb44c408\"" -> "W/\"472d7f79e86346b7d6bb6a1953e2f338a58242063aa2e0e5ee1db93bb4b4ef49\""
        id         = "4698127:quarkus-jjwt-jackson"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_operator_sdk has been changed
  ~ resource "github_repository" "quarkus_operator_sdk" {
      ~ etag                   = "W/\"9b1b43aaf1f558e3e513add236cdba35ed539c17ae617c5532847f883f9a0c4f\"" -> "W/\"431fa4c8f83242a3148f483ae5ef76cf8ce5eb085f1ee84d1ea3bc24c8cba5b1\""
        id                     = "quarkus-operator-sdk"
        name                   = "quarkus-operator-sdk"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_repository.quarkus_mybatis has been changed
  ~ resource "github_repository" "quarkus_mybatis" {
      ~ etag                   = "W/\"652d62639ace10e0194d679f493cb3e7b0e61135cd1533938591f2f57f56c4f7\"" -> "W/\"5a185ac04569a5f6871af5e3318f1e24c1f519c6f860134032a1475e95e88f53\""
        id                     = "quarkus-mybatis"
        name                   = "quarkus-mybatis"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_repository.quarkus_morphia has been changed
  ~ resource "github_repository" "quarkus_morphia" {
      ~ etag                   = "W/\"75d536516f70874818debd13715b47aac26220570118898113f7e486c7d25acb\"" -> "W/\"061724bf099ff1a30b38276c741e90474875698cb168083cb7a0893420775c6b\""
        id                     = "quarkus-morphia"
        name                   = "quarkus-morphia"
        # (25 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_logging_cloudwatch has been changed
  ~ resource "github_team_repository" "quarkus_logging_cloudwatch" {
      ~ etag       = "W/\"12f8b150a822043fc869bda8211272f5cdb8b52dc255b5d2ed4f0c1b9393970c\"" -> "W/\"d8b0952edb810bbb962d4c0c330120448f4dbb2fe245450f92d3c24fe717fd9a\""
        id         = "4766806:quarkus-logging-cloudwatch"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_doma has been changed
  ~ resource "github_repository" "quarkus_doma" {
      ~ etag                   = "W/\"0dc2847c83f0c3ab8d05787a1817f3ac6a2bd137d5ec029a7b034b77a1e6eaf0\"" -> "W/\"a1ae0e2fbf1b83b1b602e9472c16b5c1a08a9692dd87130bec86df4f423b06cf\""
        id                     = "quarkus-doma"
        name                   = "quarkus-doma"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.quarkus_google_cloud_services has been changed
  ~ resource "github_team_repository" "quarkus_google_cloud_services" {
      ~ etag       = "W/\"572212ac42aa1d6aef458d902a63ab9569785f1e4ac297ea6ee6cd5e00c9dbf6\"" -> "W/\"a62d8496e38c21ee23092cf401885b7a1c7cc12e3e72144cf740880891d39270\""
        id         = "4133757:quarkus-google-cloud-services"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_microprofile has been changed
  ~ resource "github_team_repository" "quarkus_microprofile" {
      ~ etag       = "W/\"4966c4cb9459b1a8f7c044c21c847aad799e28896cb87cbc5733262d40f1ee7f\"" -> "W/\"4bb67a91ea0e243b0069d5e28316104030befaa09f8e4c080c997505aba5f5b7\""
        id         = "5018652:quarkus-microprofile"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_logging_manager has been changed
  ~ resource "github_repository" "quarkus_logging_manager" {
      ~ etag                   = "W/\"2df5a5452c5f1a9f6ea9d0561381edcec3072f98050c1a11c684e0b58a783be7\"" -> "W/\"6f907c8ee297006528d70b0738c69360bdb7db48c70c24d207ee287f738d4035\""
        id                     = "quarkus-logging-manager"
        name                   = "quarkus-logging-manager"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.quarkus_doma has been changed
  ~ resource "github_team_repository" "quarkus_doma" {
      ~ etag       = "W/\"891ffa6a16b0022dfcba091a6a20bbab0a4177ac77b8084680b30981bf29f8e6\"" -> "W/\"33105b383bda8a22288157c8707d9b9598978a63b031a766563832beaf330025\""
        id         = "4206574:quarkus-doma"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_kerberos has been changed
  ~ resource "github_repository" "quarkus_kerberos" {
      ~ etag                   = "W/\"476932fa5e198c8c6c05b37291d86f8d824cbb196b048685b3ab4baeef84f9a8\"" -> "W/\"0cf7f379f4f873e6bea1dd1ff3ff0d19181834c0ae230f1a60e64c27b91965c2\""
        id                     = "quarkus-kerberos"
        name                   = "quarkus-kerberos"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_repository.quarkus_github_api has been changed
  ~ resource "github_repository" "quarkus_github_api" {
      ~ etag                   = "W/\"37423e501cfef01004612d3d492504c622ce3ac54b92b30033902a3b3f9b8c55\"" -> "W/\"6e530f7578101ff3065c532a2fd8e86691c59ddf12915156ab3a52cb3582d674\""
        id                     = "quarkus-github-api"
        name                   = "quarkus-github-api"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_repository.quarkus_jberet has been changed
  ~ resource "github_repository" "quarkus_jberet" {
      ~ etag                   = "W/\"52f66ab6b59d4df4f75e392e61661740dd9ab6f2f2f8ffbf40f13bfa7c12b1ba\"" -> "W/\"150bf0fdf632db43a4a45829670a2389c47231793ab604434f72902b9bd53e00\""
        id                     = "quarkus-jberet"
        name                   = "quarkus-jberet"
        # (25 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_hibernate_types has been changed
  ~ resource "github_team_repository" "quarkus_hibernate_types" {
      ~ etag       = "W/\"40e7fe5c992d7e7dab1239da9f0217ba900b11690da98db04529541b93db6ef8\"" -> "W/\"9aed6f634ec881b7e7c396781c4ba84e80ccba79ee392affaa8e082642dfb0b9\""
        id         = "4427586:quarkus-hibernate-types"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_logging_cloudwatch has been changed
  ~ resource "github_repository" "quarkus_logging_cloudwatch" {
      ~ etag                   = "W/\"250f1f3dc754118150b28dd1b3e70f61c0defdd17cd24c3cb9a82c41d4eb0c21\"" -> "W/\"814bec9cfaa02fd3d33697f1653b70db1b6eded4f8543e29b970fe70e3cc9ad5\""
        id                     = "quarkus-logging-cloudwatch"
        name                   = "quarkus-logging-cloudwatch"
        # (25 unchanged attributes hidden)
    }
  # github_repository.quarkus_tika has been changed
  ~ resource "github_repository" "quarkus_tika" {
      ~ etag                   = "W/\"e637c285ab5a539aa3aa5a83d31956b8f1679019903cf91db1cd270a800f2119\"" -> "W/\"7bca7a50e3c30ddbd99207ccb5b5f23afd499aa9be3484d922f2ca0cc499327f\""
        id                     = "quarkus-tika"
        name                   = "quarkus-tika"
        # (24 unchanged attributes hidden)
    }
  # github_repository.quarkus_apicurio_registry_client has been changed
  ~ resource "github_repository" "quarkus_apicurio_registry_client" {
      ~ etag                   = "W/\"48b52deaf430b4fa359f13f7b3b65a6eadd76a94d4b346ef8daf600764f4a332\"" -> "W/\"7cea56a31b35562c0ac58cebc0748c7b852eee5ff6554f83e402965e8482f565\""
        id                     = "quarkus-apicurio-registry-client"
        name                   = "quarkus-apicurio-registry-client"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.quarkus_xmlsec has been changed
  ~ resource "github_team_repository" "quarkus_xmlsec" {
      ~ etag       = "W/\"0cc5e132ae348c4143c029da2360232e61609173a5d5d56c08f9ee155f55bfa9\"" -> "W/\"7500cdf2d5e0997df37b661d90d29e7cc1da12df86418d9f1278d0813bae5ea7\""
        id         = "5249540:quarkus-xmlsec"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_freemarker has been changed
  ~ resource "github_team_repository" "quarkus_freemarker" {
      ~ etag       = "W/\"4e591dc9cfad6bde1ed3ae79ea63c55ea66c5934b23e7e764237a077e62ebd3b\"" -> "W/\"1a207793696720d1b4ae1b1e4b2da20177b1d7b2883c332ead37c6990d0e1927\""
        id         = "4139356:quarkus-freemarker"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_jberet has been changed
  ~ resource "github_team_repository" "quarkus_jberet" {
      ~ etag       = "W/\"a8ca9ea3158110ff5eff6fefb498e6c151df58d693cf07394506ff75a0d16328\"" -> "W/\"62fa04c67d0e43200c6b2c1c73da4de8cdd14f5c94b64b5a03e92d5db389fc85\""
        id         = "4130738:quarkus-jberet"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_kerberos has been changed
  ~ resource "github_team_repository" "quarkus_kerberos" {
      ~ etag       = "W/\"d50efd08575b69c10edba64710821884ee6fee595e57d67c4288cd2fa937ea89\"" -> "W/\"feb7ebee53b71fb85042e512b03d232f8db6a5542446efc25f69fe209ff798c2\""
        id         = "5330599:quarkus-kerberos"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_maven_resolver has been changed
  ~ resource "github_team_repository" "quarkus_maven_resolver" {
      ~ etag       = "W/\"d4e74c5ba796ca9967c7fa862e3e3413babaaa4b9dcd5007a5ff50281833d8e5\"" -> "W/\"cd5ca7077dc2d9561fd5c9eae6f12fab3ad0738d26999c776b41f2542ee9166b\""
        id         = "5330694:quarkus-maven-resolver"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_jjwt_jackson has been changed
  ~ resource "github_repository" "quarkus_jjwt_jackson" {
      ~ etag                   = "W/\"9b3299b25889c0356d6cd3acac420af6d29c01cc36aa9b20e18aeb08acf11fa1\"" -> "W/\"13ea4a13cef80fbe432997d23a3856895d840eefa667a8db547c31888597b3c9\""
        id                     = "quarkus-jjwt-jackson"
        name                   = "quarkus-jjwt-jackson"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.quarkus_prettytime has been changed
  ~ resource "github_team_repository" "quarkus_prettytime" {
      ~ etag       = "W/\"140aa3beb971dbbb70f076259820f3e665ecb1fb984db431162769848103dbff\"" -> "W/\"5bb083375cead5d58822340c4e426203914cef7e7152178c3ebf59a6871649c0\""
        id         = "4612233:quarkus-prettytime"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_lucene has been changed
  ~ resource "github_team_repository" "quarkus_lucene" {
      ~ etag       = "W/\"a750a90fc38500ebb8289423ecc182ce3b5dc6796a8ca089190140305e121148\"" -> "W/\"32c6c4b703fcb6411af3b2f4e57f73fd0ba0509fbc1d29a846802e26ad0bb275\""
        id         = "4572442:quarkus-lucene"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_opencv has been changed
  ~ resource "github_repository" "quarkus_opencv" {
      ~ etag                   = "W/\"61bca9fca5116f49a336619e6da51db742098281c417c0d17d43f612d2154118\"" -> "W/\"f9ae832c3e71b65b4403c37a5e088b8c7968167b79bffa91a9c3cb17a3b6ba93\""
        id                     = "quarkus-opencv"
        name                   = "quarkus-opencv"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_repository.quarkus_lucene has been changed
  ~ resource "github_repository" "quarkus_lucene" {
      ~ etag                   = "W/\"5799c33754c6ee20f0134a74bbb5faec62e943054d3c7ad9939ece286e8077ca\"" -> "W/\"1b9a5b45aa819c1f132b2ba854f6412ea61b71c62dcabf1301a6dd8c219a3a5b\""
        id                     = "quarkus-lucene"
        name                   = "quarkus-lucene"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_repository.quarkus_maven_resolver has been changed
  ~ resource "github_repository" "quarkus_maven_resolver" {
      ~ etag                   = "W/\"4184d62bac0fed4923968670cf7d40464625f831ba2f80b4d492a1610ce009f5\"" -> "W/\"cce929a1f90afd030148b29a3de6e5ddde7da9443d63f9f9a999b0acdf2200a7\""
        id                     = "quarkus-maven-resolver"
        name                   = "quarkus-maven-resolver"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_repository.quarkus_jackson_jq has been changed
  ~ resource "github_repository" "quarkus_jackson_jq" {
      ~ etag                   = "W/\"1b55511a96becee7e9712ce935cfe94f6831b1b752a056200ec89ed37b8522c9\"" -> "W/\"a86ad5141c8773858f900e870635b89b26a68b2e7d1063a6b373fb8ca9f6621e\""
        id                     = "quarkus-jackson-jq"
        name                   = "quarkus-jackson-jq"
        # (25 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_logging_splunk has been changed
  ~ resource "github_team_repository" "quarkus_logging_splunk" {
      ~ etag       = "W/\"d330f6bd633b48b771f6a252e086390e1aa623b187b5f680ff1512f360e63b77\"" -> "W/\"2fa425451ce6329740c616a09c382c7339f26b16c0f23acd4315438e1c1f3e5f\""
        id         = "4611522:quarkus-logging-splunk"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_minio has been changed
  ~ resource "github_repository" "quarkus_minio" {
      ~ etag                   = "W/\"8b17336bf1e2f850d6c29f4773184cfbc06119846679b4944afe8f74a0833244\"" -> "W/\"d41ebdc0690a27e91d3c775802ef94b0fbbbcc2487b275859925da43848b72b5\""
        id                     = "quarkus-minio"
        name                   = "quarkus-minio"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_repository.quarkus_micrometer_registry has been changed
  ~ resource "github_repository" "quarkus_micrometer_registry" {
      ~ etag                   = "W/\"9d931b6ca15ecbd041b74d0a7a3fb02d24ad14f92f0bdbb67fd008b1b1bba393\"" -> "W/\"8848d1b9f258c2bc6ca95c871dc6843dde23807c31e8bb117ae71dc35555936a\""
        id                     = "quarkus-micrometer-registry"
        name                   = "quarkus-micrometer-registry"
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.quarkus_hivemq_client has been changed
  ~ resource "github_team_repository" "quarkus_hivemq_client" {
      ~ etag       = "W/\"ed506d71fdd23a1c33e3bfdb5b321922a4de9ebf0bc9d2dc8d68cedf9c0351c6\"" -> "W/\"892f0e5547dfb9a25aa9e1e6e6e423c22f28ee57aa87152eb336a6f367dc85e2\""
        id         = "4651319:quarkus-hivemq-client"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_operator_sdk has been changed
  ~ resource "github_team_repository" "quarkus_operator_sdk" {
      ~ etag       = "W/\"015afae3ded0c0b4a5b06bcc7ecbeff789a79c2b7ec9b874c0c52d2f2c8b80a9\"" -> "W/\"5520059b7ae5b158f4e7c880a995ef8fd6c8ac20f2d15e066574a64520e4e31b\""
        id         = "4585468:quarkus-operator-sdk"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_logging_json has been changed
  ~ resource "github_repository" "quarkus_logging_json" {
      ~ etag                   = "W/\"43f70b370e30625a471333ed48d4653ac4a9c2dcd25cd3515e68a616a257dee4\"" -> "W/\"b165a3164a2719c8afa07e4719518e90730a94eba6dac6c2d11f8517960b8e11\""
        id                     = "quarkus-logging-json"
        name                   = "quarkus-logging-json"
        # (25 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_jackson_jq has been changed
  ~ resource "github_team_repository" "quarkus_jackson_jq" {
      ~ etag       = "W/\"0b1d92897a9e374b1afe12c47ee27891263b17664b431d0900c36393732afa80\"" -> "W/\"7f44e3d02f63a94a4c9aeed86fcb50632ba7b1fbed7c2c07a60a96ff749851ee\""
        id         = "5182252:quarkus-jackson-jq"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_elasticsearch_reactive has been changed
  ~ resource "github_repository" "quarkus_elasticsearch_reactive" {
      ~ etag                   = "W/\"3434f5a4d7f1d0a1fe3dfdf58b6fd0dd4ca10e239e58b702eaf08619703a35a0\"" -> "W/\"c6c65868479022205adf63a83908845618828075f813fcbab86c01698420933c\""
        id                     = "quarkus-elasticsearch-reactive"
        name                   = "quarkus-elasticsearch-reactive"
        # (25 unchanged attributes hidden)
    }
  # github_repository.quarkus_freemarker has been changed
  ~ resource "github_repository" "quarkus_freemarker" {
      ~ etag                   = "W/\"eb2e117c3b47dce9519ffb47320d8ad4315e48b623f0df23dab00efb1949d73b\"" -> "W/\"075e63d09ab4971013f359ecd1f054bc652de2acce87113e3efad69d919c402a\""
        id                     = "quarkus-freemarker"
        name                   = "quarkus-freemarker"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.quarkus_tekton_client has been changed
  ~ resource "github_team_repository" "quarkus_tekton_client" {
      ~ etag       = "W/\"af0992df62a5732108e28d2b2f33b7fecdc5260f4b43811a951ab4287fc8df91\"" -> "W/\"7f13b8c4799b6b67808430bd1b3c877d1c774e18df985a0cbbe695d00bedb134\""
        id         = "4429729:quarkus-tekton-client"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_tekton_client has been changed
  ~ resource "github_repository" "quarkus_tekton_client" {
      ~ etag                   = "W/\"69d53b050c030137232a15830240f86033d808f49316d82e0416ac036609321d\"" -> "W/\"f529e630324ce7490eb1e5e1c29535d92b4001ae2e79c30e77cb7cc079b9f048\""
        id                     = "quarkus-tekton-client"
        name                   = "quarkus-tekton-client"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_team_repository.quarkus_logging_manager has been changed
  ~ resource "github_team_repository" "quarkus_logging_manager" {
      ~ etag       = "W/\"77693139b5bf9f00e7b1425022db4ada5b5456098ef1b368dbe001ae445dc89a\"" -> "W/\"8b7482fd6eb9a759be01a8469a9847aa9b914c932272d5e407f05f682453f1eb\""
        id         = "4193789:quarkus-logging-manager"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_cxf has been changed
  ~ resource "github_team_repository" "quarkus_cxf" {
      ~ etag       = "W/\"cd72315bedf4d2bc28302744140667953a84d4ebe1e7b52fcf9d44e0e260592c\"" -> "W/\"1d831ffe0d514a9deaf152c8080c13a23050599065e04acfdd43a7655e3148f6\""
        id         = "4221025:quarkus-cxf"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_datadog_opentracing has been changed
  ~ resource "github_team_repository" "quarkus_datadog_opentracing" {
      ~ etag       = "W/\"71f2bc83b83806813853f6b77fed3cbfac7c20ac75cc1c3b4a5df00b8a3a8377\"" -> "W/\"a948bdbaf32ab00e939f7066c37b0bcac3507a3d5ca68977e8a7c82cdc6f9db7\""
        id         = "4759562:quarkus-datadog-opentracing"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_minio has been changed
  ~ resource "github_team_repository" "quarkus_minio" {
      ~ etag       = "W/\"e9e3d6f14cd93596427f7d4daf897bdef6b81a6c5cdbaae97c52753dfe948dcf\"" -> "W/\"2526188f773448aa6e5cf07115b5543a75c905460e2759e4887d205d541db3e3\""
        id         = "4257600:quarkus-minio"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.quarkus_logging_json has been changed
  ~ resource "github_team_repository" "quarkus_logging_json" {
      ~ etag       = "W/\"c9fc4ada1edb73fb9dad15582767f8a7f58266383fa9bf133ef9156bedcd3374\"" -> "W/\"72f941f907c9d81898d7b5367f3ad9f47d32db62a8eed929a276027fc4184d8c\""
        id         = "4136031:quarkus-logging-json"
        # (3 unchanged attributes hidden)
    }
  # github_repository.quarkus_google_cloud_services has been changed
  ~ resource "github_repository" "quarkus_google_cloud_services" {
      ~ etag                   = "W/\"a1b8880fab01b12a6f8b957c6c44df115e6c471d79109c452892cca9f61426e5\"" -> "W/\"51caea97d7277d574b80134647c9f5c620a3f8f4bc2085690a006a9d50b025e2\""
        id                     = "quarkus-google-cloud-services"
        name                   = "quarkus-google-cloud-services"
        # (26 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch.quarkus_jgit will be created
  + resource "github_branch" "quarkus_jgit" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "quarkus-jgit"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch.quarkus_jsch will be created
  + resource "github_branch" "quarkus_jsch" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "quarkus-jsch"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch_default.quarkus_jgit will be created
  + resource "github_branch_default" "quarkus_jgit" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "quarkus-jgit"
    }

  # github_branch_default.quarkus_jsch will be created
  + resource "github_branch_default" "quarkus_jsch" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "quarkus-jsch"
    }

  # github_repository.quarkus_jgit will be created
  + resource "github_repository" "quarkus_jgit" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Quarkus JGit extension"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "quarkus-jgit"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "quarkus-extension",
        ]
      + visibility             = (known after apply)
      + vulnerability_alerts   = true
    }

  # github_repository.quarkus_jsch will be created
  + resource "github_repository" "quarkus_jsch" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Quarkus JSch extension"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "quarkus-jsch"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "quarkus-extension",
        ]
      + visibility             = (known after apply)
      + vulnerability_alerts   = true
    }

  # github_team.quarkus_jgit will be created
  + resource "github_team" "quarkus_jgit" {
      + create_default_maintainer = false
      + description               = "Quarkiverse team for the JGit extension"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-jgit"
      + node_id                   = (known after apply)
      + parent_team_id            = 5344029
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.quarkus_jsch will be created
  + resource "github_team" "quarkus_jsch" {
      + create_default_maintainer = false
      + description               = "Quarkiverse team for the JSch extension"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-jsch"
      + node_id                   = (known after apply)
      + parent_team_id            = 5344029
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.quarkus_jgit["gastaldi"] will be created
  + resource "github_team_membership" "quarkus_jgit" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "gastaldi"
    }

  # github_team_membership.quarkus_jsch["gastaldi"] will be created
  + resource "github_team_membership" "quarkus_jsch" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "gastaldi"
    }

  # github_team_membership.quarkus_xmlsec["martinffx"] will be created
  + resource "github_team_membership" "quarkus_xmlsec" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "5249540"
      + username = "martinffx"
    }

  # github_team_repository.quarkus_jgit will be created
  + resource "github_team_repository" "quarkus_jgit" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-jgit"
      + team_id    = (known after apply)
    }

  # github_team_repository.quarkus_jsch will be created
  + resource "github_team_repository" "quarkus_jsch" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-jsch"
      + team_id    = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @gsmet, Action: `pull_request`*